{
  "quiz_id": "quiz_2026_01_27_general_medicine",
  "subject": "General Medicine",
  "questions": [
    {
      "id": "dbeabbf3-02fe-4d9f-a734-9faae32e67af",
      "question": "A 15-year-old boy presented with one day history of bleeding gum, subconjunctival bleed and purpuric rash. Investigations revealed following results: Hb- 6.4 gm/dL; TLC-1,00,000/ÂµL, platelet 35,000/mmÂ³; prothrombin time-20 sec with a control of 13 sec; partial thromboplastin time-50 sec; and Fibrinogen 10mg/dL. Peripheral smear was suggestive of acute myeloblastic leukemia. Which of the following is the most likely?",
      "opa": "Myeloblastic leukemia without maturation",
      "opb": "Myeloblastic leukemia with maturation",
      "opc": "Promyelocytic leukemia",
      "opd": "Myelomonocytic leukemia",
      "cop": 3,
      "explanation": "**Concept:** Acute Promyelocytic Leukemia (APL) is a subtype of acute myeloblastic leukemia characterized by a specific chromosomal translocation t(15;17), resulting in the PML-RARalpha fusion gene. This leads to a block in myeloid differentiation at the promyelocyte stage. Clinically, APL presents with a high risk of disseminated intravascular coagulation (DIC) due to the release of procoagulant factors from abnormal promyelocytes.\n\n**Reasoning:** The clinical presentation – bleeding gums, subconjunctival hemorrhage, purpuric rash – strongly suggests a bleeding diathesis. The laboratory findings are highly suggestive of DIC: low hemoglobin (6.4 gm/dL), elevated TLC (1,00,000/µL), thrombocytopenia (35,000/mm³), prolonged prothrombin time (20 sec vs control 13 sec), prolonged partial thromboplastin time (50 sec), and significantly reduced fibrinogen (10 mg/dL).  The peripheral smear confirming acute myeloblastic leukemia further narrows the diagnosis. Among the AML subtypes, promyelocytic leukemia is most classically associated with DIC due to the abnormal promyelocytes releasing tissue factor and other procoagulant substances. \n\n**Why wrong:**\n*   **A. Myeloblastic leukemia without maturation:** While it presents with pancytopenia, it doesn't typically cause the severe DIC picture seen here with such dramatically reduced fibrinogen levels. \n*   **B. Myeloblastic leukemia with maturation:** This subtype is less likely to present with such a profound coagulopathy. The presence of maturation usually indicates a less aggressive form of the disease.\n*   **D. Myelomonocytic leukemia:** This subtype involves both myeloid and monocytic precursors. While it can cause bleeding, the degree of coagulopathy and the specific findings (very low fibrinogen) are less characteristic of myelomonocytic leukemia compared to APL.\n\n**Key Takeaway:** APL should be suspected in any patient presenting with acute leukemia and signs of DIC. Rapid diagnosis and treatment (typically with all-trans retinoic acid and arsenic trioxide) are crucial due to the high risk of fatal bleeding.\n\n**Mnemonic:** 'APL – Always Promotes Lethality (and DIC)'",
      "ai_search_tags": "Acute Promyelocytic Leukemia > Hematologic Malignancies > Coagulation Disorders > Pathology > Oncology",
      "subject_name": "General Medicine",
      "topic_name": null,
      "difficulty": "Medium",
      "is_clinical": true,
      "pyq_source": "NEET PG"
    },
    {
      "id": "68cd8375-b7d2-4435-ae9d-3fb038daa99f",
      "question": "In thyrotoxicosis, beta-blockers are least effective in controlling which of the following symptoms?",
      "opa": "Anxiety",
      "opb": "Tremors",
      "opc": "Tachycardia",
      "opd": "Oxygen consumption",
      "cop": 4,
      "explanation": "**Concept:** Thyrotoxicosis (hyperthyroidism) is a condition of excessive thyroid hormone levels, leading to a hypermetabolic state. Beta-blockers are commonly used to manage the *symptoms* of thyrotoxicosis, but they do not address the underlying hormonal excess.\n\n**Reasoning:** Beta-blockers effectively counteract many of the adrenergic symptoms of thyrotoxicosis – anxiety, tremors, tachycardia, and palpitations – by blocking the effects of catecholamines on beta-adrenergic receptors. However, they have minimal impact on the increased basal metabolic rate and, consequently, oxygen consumption. Oxygen consumption is directly related to the increased thyroid hormone levels and the resulting metabolic acceleration. Reducing oxygen consumption requires addressing the underlying hyperthyroidism with antithyroid drugs, radioactive iodine, or surgery.\n\n**Why wrong:**\n*   **Anxiety:** Beta-blockers reduce sympathetic outflow, alleviating anxiety.\n*   **Tremors:** Beta-blockers block beta-2 receptors, reducing tremors.\n*   **Tachycardia:** Beta-blockers directly block beta-1 receptors in the heart, slowing heart rate.\n\n**Key Takeaway:** Beta-blockers are symptomatic treatment for thyrotoxicosis, targeting adrenergic symptoms. They do *not* reduce the underlying metabolic derangement or oxygen consumption.\n\n**Mnemonic:** None",
      "ai_search_tags": "Endocrinology > Hyperthyroidism > Beta-Blockers > Symptom Management > Thyroid Disorders",
      "subject_name": "General Medicine",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "6bcedd89-ecd5-475b-a155-ec7f82f6f29f",
      "question": "Muscle tone increasing in a patient trying to relax the muscles is seen in?",
      "opa": "Paratonia",
      "opb": "Myotonia",
      "opc": "Spasticity",
      "opd": "Rigidity",
      "cop": 1,
      "explanation": "**Concept:** Muscle tone refers to the continuous state of partial contraction in muscles. Several neurological conditions can affect muscle tone, leading to increased or decreased resistance to passive movement.\n\n**Reasoning:** Paratonia is characterized by increased tone that is velocity-dependent *and* direction-dependent. This means the resistance to movement increases not just with speed, but also depends on the direction of the movement. The question specifically states 'muscle tone increasing in a patient trying to relax the muscles', which aligns with the paradoxical increase in tone seen in paratonia, even when the patient attempts to relax. It's often seen in frontal lobe lesions.\n\n**Why wrong:**\n*   **Myotonia:** Myotonia involves delayed muscle relaxation after contraction. While there's increased muscle tone *during* the contraction, it's not about tone increasing while *trying* to relax. It's a problem with releasing the contraction, not an increase in tone during attempted relaxation.\n*   **Spasticity:** Spasticity is velocity-dependent, meaning resistance increases with the speed of movement. However, it's generally not direction-dependent like paratonia, and doesn't necessarily manifest as increased tone during attempted relaxation.\n*   **Rigidity:** Rigidity is characterized by increased tone that is constant and doesn't vary with velocity. It's often described as 'cogwheel' rigidity, and doesn't fit the scenario of tone increasing during relaxation.\n\n**Key Takeaway:** Paratonia is unique in its velocity *and* direction dependence, and its manifestation as increased tone even when the patient is attempting to relax their muscles. This makes it the most accurate answer.\n\n**Mnemonic:** 'Para' means beside or alongside – think of paratonia as tone 'alongside' the intended relaxation, going against the patient's will.",
      "ai_search_tags": "Neurology > Movement Disorders > Muscle Tone > Paratonia > Frontal Lobe Dysfunction",
      "subject_name": "General Medicine",
      "topic_name": null,
      "difficulty": "Medium",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "d84bbbff-2835-4d0a-bd1f-2b8ee74e126c",
      "question": "Investigation of choice in bronchiectasis is",
      "opa": "Bronchoscopy",
      "opb": "MRI thorax",
      "opc": "HRCT lung",
      "opd": "Chest X-ray",
      "cop": 3,
      "explanation": "**Concept:** Bronchiectasis is a chronic condition where the bronchi are permanently dilated, leading to recurrent infections and inflammation. Diagnosis requires demonstrating these structural changes.\n\n**Reasoning:** High-Resolution Computed Tomography (HRCT) of the lungs is the investigation of choice for bronchiectasis. It directly visualizes bronchial wall thickening, bronchial dilation (signet ring sign), and the presence of mucus impaction, all hallmarks of the disease. It's highly sensitive and specific, even in early stages or when chest X-ray findings are subtle.\n\n**Why wrong:**\n*   **Bronchoscopy:** While useful for airway clearance and obtaining samples for microbiology, bronchoscopy doesn't provide a comprehensive view of the lung parenchyma to assess the extent of bronchiectasis.\n*   **MRI thorax:** MRI is less sensitive than HRCT for detecting subtle bronchial wall changes and is generally not the first-line imaging modality for bronchiectasis. It's more useful for evaluating associated complications or differential diagnoses.\n*   **Chest X-ray:** Chest X-ray can suggest bronchiectasis (e.g., tram-track lines, ring shadows), but it has limited sensitivity and specificity. It often misses early or mild cases and cannot reliably assess the extent of the disease.\n\n**Key Takeaway:** HRCT lung is the gold standard for diagnosing bronchiectasis due to its superior ability to visualize bronchial wall abnormalities and assess disease severity.\n\n**Mnemonic:** None",
      "ai_search_tags": "Pulmonology > Bronchiectasis > Diagnostic Imaging > HRCT > Respiratory System",
      "subject_name": "General Medicine",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "4aa67896-7781-4bc4-a2c2-5c1d27964905",
      "question": "Which of the following parasite can cause a duodenal stricture?",
      "opa": "Ascaris lumbricoides",
      "opb": "Strongyloides stercoralis",
      "opc": "Chlonorchis sinensis",
      "opd": "Ankylostoma duodenale",
      "cop": 2,
      "explanation": "**Concept:** Duodenal strictures are narrowing of the duodenum, often caused by chronic inflammation, scarring, or obstruction. Parasitic infections can sometimes lead to this complication.\n\n**Reasoning:** Strongyloides stercoralis is the correct answer because it can cause hyperinfection syndrome, particularly in immunocompromised individuals. During this syndrome, the larvae disseminate widely, and can infiltrate the duodenal wall causing significant inflammation and fibrosis. Repeated cycles of inflammation and healing can ultimately lead to duodenal stricture formation. The larvae burrow into the mucosa, causing local damage and potentially obstructing the lumen over time.\n\n**Why wrong:**\n*   **Ascaris lumbricoides:** While Ascaris can cause intestinal obstruction, it typically occurs in the small intestine (often the ileus) due to a bolus of worms, not a chronic duodenal stricture. It doesn't typically cause chronic inflammation and scarring in the duodenum.\n*   **Chlonorchis sinensis:** This is a liver fluke. It primarily affects the bile ducts and liver, causing cholangitis and potentially biliary strictures, not duodenal strictures.\n*   **Ankylostoma duodenale:** This hookworm causes iron deficiency anemia through blood loss at the site of intestinal attachment. It doesn't typically cause significant duodenal inflammation or stricture formation. It attaches to the small intestinal mucosa, but doesn't burrow and cause the same degree of chronic damage as Strongyloides.\n\n**Key Takeaway:** Strongyloides stercoralis is uniquely capable of causing duodenal strictures due to its ability to penetrate the duodenal mucosa and cause chronic inflammation and fibrosis, especially in the context of hyperinfection syndrome.\n\n**Mnemonic:** 'Strongyloides' – Think 'Strong' burrowing leading to 'strictures'.",
      "ai_search_tags": "Parasitology > Intestinal Parasites > Strongyloides stercoralis > Duodenal Stricture > Gastroenterology",
      "subject_name": "General Medicine",
      "topic_name": null,
      "difficulty": "Medium",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "efc0932a-558e-462a-bc93-75501d4d27b9",
      "question": "A 7 year old boy presented with generalized edema. Urine examination revealed marked albuminuria. Serum biochemical examinations showed hypoalbuminemia with hyperlipidemia. Kidney biopsy was undertaken. On light microscopic examination, the kidney appeared normal. Electron microscopic examination is most likely to reveal-",
      "opa": "Fusion of foot processes of the glomerular epithelial cells",
      "opb": "Rarefaction of glomerular basement membrane",
      "opc": "Deposition of electron dense material in the basement membrane",
      "opd": "Thin basement membrane",
      "cop": 1,
      "explanation": "**Concept:** Nephrotic Syndrome\n\n**Reasoning:** The clinical presentation – generalized edema, marked albuminuria, hypoalbuminemia, and hyperlipidemia – strongly suggests Nephrotic Syndrome. The key finding here is *normal light microscopy* coupled with the clinical picture. This points towards Minimal Change Disease (MCD), the most common cause of nephrotic syndrome in children. The hallmark of MCD is the *fusion of foot processes* of the glomerular epithelial cells, which is best visualized by electron microscopy. While light microscopy appears normal, electron microscopy reveals the effacement or fusion of these foot processes, leading to the loss of the filtration barrier and subsequent proteinuria.\n\n**Why wrong:**\n\nA. Rarefaction of glomerular basement membrane: This is seen in focal segmental glomerulosclerosis (FSGS), not typically MCD.\n\nB. Deposition of electron dense material in the basement membrane: This is characteristic of membranous nephropathy or post-streptococcal glomerulonephritis, which usually present with different clinical features and would be visible on light microscopy (immune deposits).\n\nD. Thin basement membrane: This is seen in benign familial hematuria and doesn't typically cause nephrotic syndrome.\n\n**Key Takeaway:**  In a child presenting with nephrotic syndrome and normal light microscopy, suspect Minimal Change Disease and expect to see fusion of foot processes on electron microscopy.\n\n**Mnemonic:** None",
      "ai_search_tags": "Nephrology > Glomerular Diseases > Minimal Change Disease > Kidney Biopsy > Electron Microscopy",
      "subject_name": "General Medicine",
      "topic_name": null,
      "difficulty": "Medium",
      "is_clinical": true,
      "pyq_source": "NEET PG"
    },
    {
      "id": "a653f2ba-4344-4f5d-935f-af27f0113cd6",
      "question": "Amaurosis fugax is caused by occlusion of",
      "opa": "Facial artery",
      "opb": "Occipital artery",
      "opc": "Central retinal artery",
      "opd": "Posterior auricular artery",
      "cop": 3,
      "explanation": "**Concept:** Amaurosis fugax is a temporary loss of vision in one eye due to a transient lack of blood flow to the retina. \n   **Reasoning:** The correct answer is C, Central retinal artery, because it is the main artery that supplies blood to the retina. Occlusion of this artery would lead to a sudden, painless loss of vision in one eye, which is characteristic of amaurosis fugax. \n   **Why wrong:** Options A, B, and D are incorrect because the facial artery, occipital artery, and posterior auricular artery do not supply blood directly to the retina. \n   **Key Takeaway:** Amaurosis fugax is often a sign of an underlying vascular condition, such as atherosclerosis or carotid artery disease, and requires prompt medical attention to prevent further complications. \n   **Mnemonic:** 'Amaurosis fugax is like a fleeting shadow on the retina, caused by a blockage in the central retinal artery'",
      "ai_search_tags": "Ophthalmology > Retina > Vascular Occlusion > Neurological Symptoms > Internal Medicine",
      "subject_name": "General Medicine",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "fa2d1a70-f610-4706-b14e-e9dd9e69f31f",
      "question": "The 'c' wave in the jugular venous pulse (JVP) is due to:",
      "opa": "Atrial contraction",
      "opb": "Tricuspid valve bulging into right atrium",
      "opc": "Right atrial filling",
      "opd": "Rapid ventricular filling",
      "cop": 2,
      "explanation": "**Concept:** The jugular venous pulse (JVP) reflects right atrial pressure changes transmitted to the internal jugular vein. It consists of 'a', 'c', 'v', and sometimes 'x' and 'y' waves. The 'c' wave specifically relates to events occurring during ventricular systole.\n\n**Reasoning:** The 'c' wave represents the bulging of the tricuspid valve into the right atrium during isovolumetric contraction. As the ventricles begin to contract, the pressure in the ventricles rises rapidly, causing the tricuspid valve to close and bulge backwards into the right atrium. This movement creates the 'c' wave in the JVP. This happens *before* atrial contraction.\n\n**Why wrong:**\n*   **A. Atrial contraction:** Atrial contraction creates the 'a' wave, not the 'c' wave.\n*   **C. Right atrial filling:** Right atrial filling contributes to the 'x' descent, which follows the 'c' wave, as the atrium relaxes and fills.\n*   **D. Rapid ventricular filling:** Rapid ventricular filling causes the 'v' wave, which occurs after the 'x' descent, as blood flows into the right atrium against a closed tricuspid valve.\n\n**Key Takeaway:** Remember the 'c' wave is a systolic event caused by the tricuspid valve movement, not atrial activity or ventricular filling.\n\n**Mnemonic:** 'c' for closure and bulging of the Tricuspid valve.",
      "ai_search_tags": "Jugular Venous Pulse > JVP > Cardiac Cycle > Tricuspid Valve > Cardiology",
      "subject_name": "General Medicine",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "a218a26d-9050-4b5f-bda6-f3d4a227bc36",
      "question": "Corpulence index means",
      "opa": "Measurement of copper level in the serum",
      "opb": "Measurement of obesity",
      "opc": "Measurement of iron loss in faeces",
      "opd": "Pressure difference between various chambers of the heart",
      "cop": 2,
      "explanation": "**Concept:** Corpulence refers to excessive body fat, and an index used to quantify this is a measure of obesity.\n\n**Reasoning:** The term 'corpulence index' directly relates to assessing the degree of obesity. While various methods exist to measure obesity (BMI, waist circumference, skinfold thickness), 'corpulence index' is a general term encompassing these measurements. Therefore, option B is the most accurate answer.\n\n**Why wrong:**\n*   A. Measurement of copper level in the serum: This relates to conditions like Wilson's disease and Menkes disease, and is not related to corpulence.\n*   C. Measurement of iron loss in faeces: This is relevant to iron deficiency anemia and gastrointestinal bleeding, not obesity.\n*   D. Pressure difference between various chambers of the heart: This pertains to cardiac function and hemodynamics, and has no connection to corpulence.\n\n**Key Takeaway:** 'Corpulence index' is a descriptive term for measuring obesity. Understanding basic medical terminology is crucial for NEET PG.\n\n**Mnemonic:** 'Corpulent' means fat – think 'corpulence index' = 'obesity index'.",
      "ai_search_tags": "Anthropometry > Obesity > Corpulence Index > Body Composition > Nutritional Assessment",
      "subject_name": "General Medicine",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "None"
    },
    {
      "id": "3534b765-5895-4846-806a-88c8d13b2eff",
      "question": "Which part of the brain is most affected in a deep coma?",
      "opa": "Brain stem",
      "opb": "Locus ceruleus",
      "opc": "Frontal lobe",
      "opd": "Reticular Activating System (RAS)",
      "cop": 4,
      "explanation": "**Concept:** Coma represents a profound state of unconsciousness. The level of consciousness is regulated by complex interactions within the brain, but the Reticular Activating System (RAS) plays a crucial role in maintaining arousal and wakefulness.\n\n**Reasoning:** The Reticular Activating System (RAS) is a network of neurons located in the brainstem that projects widely throughout the brain. It receives sensory input and is responsible for regulating sleep-wake transitions and levels of alertness. Damage or dysfunction of the RAS leads to a significant reduction in arousal, resulting in coma. A 'deep' coma implies a severe disruption of this system. \n\n**Why wrong:**\n*   **A. Brain stem:** While the RAS *is* located within the brainstem, stating the 'brain stem' is affected is too broad. Coma isn't simply due to overall brainstem damage; it's specifically related to RAS function. Other brainstem structures control vital functions (respiration, heart rate) which may or may not be affected in a coma.\n*   **B. Locus ceruleus:** The locus ceruleus is a nucleus within the brainstem involved in arousal, but it's a component *of* the RAS, not the primary structure affected in a deep coma. It contributes to wakefulness via norepinephrine release, but damage to the locus ceruleus alone doesn't typically cause a 'deep' coma.\n*   **C. Frontal lobe:** The frontal lobe is involved in higher-order cognitive functions, but it's not directly responsible for maintaining arousal. Damage to the frontal lobe can cause altered behavior and personality changes, but typically not a deep coma unless it's accompanied by significant secondary effects impacting the RAS.\n\n**Key Takeaway:** The RAS is the primary regulator of wakefulness and arousal. Dysfunction of the RAS is the most common cause of coma, especially a deep coma.\n\n**Mnemonic:** 'RAS' – 'Really Awake System'",
      "ai_search_tags": "Neurology > Coma > Brainstem > Reticular Activating System > Internal Medicine",
      "subject_name": "General Medicine",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG, INICET, FMGE"
    }
  ]
}