{
  "subject": "Psychiatry",
  "questions": [
    {
      "id": "09608511-2c68-4690-9bf5-c02eac8764a1",
      "question": "Delusion is the disorder of:",
      "opa": "Thought",
      "opb": "Perception",
      "opc": "Always organic",
      "opd": "Always psychiatric",
      "cop": 1,
      "explanation": "**Concept:** Delusions are fixed, false beliefs that are not amenable to change in light of conflicting evidence. They represent a disturbance in thought content, rather than a problem with sensory perception.\n\n**Reasoning:** A delusion is, by definition, a disturbance in thought *content*. The individual firmly believes something that is demonstrably untrue. This belief isn't a misinterpretation of reality (that would be a perceptual disturbance); it's a false belief *about* reality. Therefore, the disorder lies within the realm of thought.\n\n**Why wrong:**\n*   **B. Perception:** While delusions can *influence* perception (e.g., a delusion of persecution might make someone hypervigilant), the core problem isn't with the sensory input itself. Hallucinations are disorders of perception.\n*   **C. Always organic:** Delusions can occur in organic brain disorders, but they are *not* always due to organic causes. Many delusions arise in purely psychiatric conditions like schizophrenia.\n*   **D. Always psychiatric:** While commonly associated with psychiatric illnesses, delusions can also occur in certain medical conditions (e.g., delirium, some neurological disorders). However, the fundamental nature of a delusion is a thought disorder, not simply a categorization of illness type.\n\n**Key Takeaway:** Delusions are fundamentally errors in thinking, representing a disturbance in thought content. Distinguish them from hallucinations, which are errors in perception.\n\n**Mnemonic:** 'Delusions are about what you *think*, hallucinations are about what you *sense*.'",
      "ai_search_tags": "Psychiatry > Psychopathology > Thought Disorders > Delusions > Schizophrenia",
      "subject_name": "Psychiatry",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "f5b12e56-0b67-46d0-820e-d72da59ef717",
      "question": "Drug of choice for \"Premenstrual Dysphoric Disorder\" is:",
      "opa": "Benzodiazepines",
      "opb": "TCAs",
      "opc": "Progesterone",
      "opd": "SSRIs",
      "cop": 4,
      "explanation": "**Concept:** Premenstrual Dysphoric Disorder (PMDD) is a severe form of premenstrual syndrome (PMS), characterized by significant emotional and physical symptoms that interfere with daily functioning. The pathophysiology involves serotonin dysregulation, similar to depression.\n\n**Reasoning:** Selective Serotonin Reuptake Inhibitors (SSRIs) are the first-line treatment for PMDD. They address the underlying serotonin deficiency believed to contribute to the mood symptoms, irritability, and other psychological manifestations of the disorder. SSRIs have demonstrated efficacy in reducing the severity of PMDD symptoms, and are generally well-tolerated.\n\n**Why wrong:**\n*   **A. Benzodiazepines:** While benzodiazepines can provide temporary relief of anxiety symptoms, they are not a long-term solution for PMDD. They carry risks of dependence, tolerance, and withdrawal, and do not address the underlying pathophysiology. \n*   **B. TCAs:** Tricyclic Antidepressants (TCAs) are older antidepressants with more side effects than SSRIs. While they can be effective for depression, SSRIs are preferred for PMDD due to their better side effect profile and targeted action on serotonin.\n*   **C. Progesterone:** Progesterone supplementation has been tried for PMS, but its efficacy in PMDD is limited and inconsistent. It's not considered a first-line treatment.\n\n**Key Takeaway:** SSRIs are the drug of choice for PMDD due to their efficacy in targeting serotonin dysregulation and their favorable side effect profile compared to other options.\n\n**Mnemonic:** 'SSRIs Solve PMDD' – a simple way to remember the first-line treatment.",
      "ai_search_tags": "Psychiatry > Mood Disorders > Premenstrual Disorders > PMDD > SSRI Treatment",
      "subject_name": "Psychiatry",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "1b1e6a29-bfa3-4def-9824-646b22ed45c5",
      "question": "In acute mania, the therapeutic serum level of lithium is typically:",
      "opa": "0.2-0.5 mEq/L",
      "opb": "0.8-1.5 mEq/L",
      "opc": "1-2 mEq/L",
      "opd": "2-5 mEq/L",
      "cop": 2,
      "explanation": "**Concept:** Lithium is a mood stabilizer primarily used in the treatment of bipolar disorder, specifically acute mania and as a prophylactic agent to prevent future episodes. Therapeutic drug monitoring is crucial due to the narrow therapeutic index of lithium – a small difference between effective and toxic doses.\n\n**Reasoning:** The therapeutic range for lithium in the treatment of acute mania is generally accepted to be 0.8 to 1.5 mEq/L. Within this range, lithium effectively stabilizes mood without causing significant toxicity. Achieving levels within this range is essential for symptom control.\n\n**Why wrong:**\n*   **A. 0.2-0.5 mEq/L:** This range is subtherapeutic. Lithium levels this low are unlikely to have a significant mood-stabilizing effect and would not be sufficient to treat acute mania.\n*   **C. 1-2 mEq/L:** While some clinical benefit might be observed at the lower end of this range, it's generally considered higher than the optimal therapeutic window. Levels approaching 2 mEq/L increase the risk of side effects.\n*   **D. 2-5 mEq/L:** This range is clearly toxic. Lithium levels above 1.5 mEq/L significantly increase the risk of adverse effects, including nausea, vomiting, tremor, ataxia, and potentially life-threatening neurological complications.\n\n**Key Takeaway:** Maintaining lithium levels within the 0.8-1.5 mEq/L range is critical for effective treatment of acute mania while minimizing the risk of toxicity. Regular monitoring of serum lithium levels is essential.\n\n**Mnemonic:** 'Lithium's therapeutic sweet spot: 0.8 to 1.5'",
      "ai_search_tags": "Bipolar Disorder > Mania > Lithium > Psychopharmacology > Psychiatry",
      "subject_name": "Psychiatry",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "aade918f-a811-4ca4-9794-efbfc1765dfd",
      "question": "Acrophobia is the fear of:",
      "opa": "Heights",
      "opb": "Snakes",
      "opc": "Cats",
      "opd": "Death",
      "cop": 1,
      "explanation": "**Concept:** Phobias are persistent, excessive, unrealistic fears of specific objects, activities, or situations. They are a type of anxiety disorder.\n\n**Reasoning:** Acrophobia specifically refers to the fear of heights. The term is derived from the Greek words 'akros' (meaning 'extreme' or 'pointed') and 'phobos' (meaning 'fear'). This aligns directly with the definition of the phobia and is the universally accepted meaning.\n\n**Why wrong:**\n*   B. Snakes: The fear of snakes is called ophidiophobia.\n*   C. Cats: The fear of cats is called ailurophobia.\n*   D. Death: The fear of death is called thanatophobia.\n\n**Key Takeaway:** Knowing the specific terminology for common phobias is important for accurate diagnosis and understanding of patient presentations. \n\n**Mnemonic:** 'Acro' sounds like 'high', helping to remember acrophobia is the fear of heights.",
      "ai_search_tags": "Psychiatry > Phobias > Specific Phobias > Acrophobia > Anxiety Disorders",
      "subject_name": "Psychiatry",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "None"
    },
    {
      "id": "26d7e60f-53f7-4a23-b9c7-382a01a1955d",
      "question": "Magical thinking is seen in which type of personality disorder?",
      "opa": "Schizotypal",
      "opb": "Borderline",
      "opc": "Narcissistic",
      "opd": "Histrionic",
      "cop": 1,
      "explanation": "**Concept:** Magical thinking involves the belief that one's thoughts, words, or actions can influence events in a way that defies logic or physical laws. It's a common feature in schizophrenia spectrum disorders.\n\n**Reasoning:** Schizotypal personality disorder is characterized by odd beliefs, magical thinking, and unusual perceptual experiences. Individuals with this disorder may believe they have special powers (like telepathy or clairvoyance) or that certain events are personally directed at them despite a lack of evidence. This aligns directly with the question's focus on magical thinking. \n\n**Why wrong:**\n*   **Borderline Personality Disorder:** Primarily involves instability in relationships, self-image, and affect, along with impulsivity. While transient psychotic-like symptoms can occur, magical thinking isn't a core feature.\n*   **Narcissistic Personality Disorder:** Characterized by a grandiose sense of self-importance, a need for admiration, and a lack of empathy. Magical thinking isn't central to this disorder.\n*   **Histrionic Personality Disorder:** Marked by excessive emotionality and attention-seeking behavior. While individuals may be dramatic, it doesn't typically involve beliefs in magical influence.\n\n**Key Takeaway:** Magical thinking is a hallmark of schizotypal personality disorder, differentiating it from other personality disorders. It represents a deviation from reality testing, though not as severe as delusions in schizophrenia.\n\n**Mnemonic:** 'Schizo'types often have 'strange' beliefs – think magical thinking!",
      "ai_search_tags": "Psychiatry > Personality Disorders > Schizotypal Personality Disorder > Thought Process > Mental Health",
      "subject_name": "Psychiatry",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "a1b74eb1-72c3-47d4-9f3a-d59f5679d5b4",
      "question": "T1-weighted axial gadolinium-enhanced MRI demonstrates an enhancing tumor of the right frontal lobe. The most likely diagnosis is:",
      "opa": "Oligodendroglioma",
      "opb": "Ependymoma",
      "opc": "PCNSL",
      "opd": "Glioblastoma multiforme",
      "cop": 4,
      "explanation": "**Concept:** Brain tumors and their MRI characteristics are crucial for diagnosis. Glioblastoma multiforme (GBM) is the most common primary brain tumor in adults, known for its aggressive nature and characteristic MRI appearance.\n\n**Reasoning:** A T1-weighted axial gadolinium-enhanced MRI showing an enhancing tumor in the right frontal lobe strongly suggests Glioblastoma multiforme. GBMs typically demonstrate ring-like enhancement with a necrotic core on contrast-enhanced MRI. The enhancement is due to the breakdown of the blood-brain barrier. The frontal lobe location is also common for GBMs. \n\n**Why wrong:**\n*   **Oligodendroglioma:** While oligodendrogliomas can enhance, they often present with a more 'fried egg' appearance on MRI, and are less likely to have the significant necrosis and ring enhancement seen in GBM. They also frequently have calcifications.\n*   **Ependymoma:** Ependymomas are typically periventricular tumors and often demonstrate a more homogeneous enhancement pattern. They are less common in the frontal lobe.\n*   **PCNSL (Primary Central Nervous System Lymphoma):** PCNSL usually presents as a homogenous enhancement, often crossing the corpus callosum. While it can occur in the frontal lobe, the described ring enhancement is more characteristic of GBM.\n\n**Key Takeaway:** Ring-enhancing lesions on gadolinium-enhanced MRI are highly suggestive of high-grade gliomas, with GBM being the most likely diagnosis in adults. \n\n**Mnemonic:** 'GBM – Grossly Bad Malignant'",
      "ai_search_tags": "Neuro-Oncology > Glioblastoma > Brain Tumors > MRI Imaging > Neurology",
      "subject_name": "Psychiatry",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "b72c9d20-5b2a-4353-ab60-fa1a899fde6b",
      "question": "Symptomatic treatment is generally not required for the withdrawal of:",
      "opa": "Cannabis",
      "opb": "Morphine",
      "opc": "Alcohol",
      "opd": "Cocaine",
      "cop": 1,
      "explanation": "**Concept:** Substance withdrawal syndromes occur due to the neuroadaptive changes the brain undergoes in response to chronic substance use. When the substance is stopped, the brain is left in a hyperexcitable state, leading to various symptoms. The severity and nature of withdrawal depend on the substance.\n\n**Reasoning:** Cannabis withdrawal is generally mild and rarely requires symptomatic treatment. Symptoms, when present, are usually non-life-threatening and include irritability, anxiety, sleep disturbance, and decreased appetite. These symptoms typically resolve within a few weeks.  Unlike opioids, alcohol, and cocaine, cannabis withdrawal doesn't typically involve severe physiological symptoms like seizures, delirium tremens, or significant cardiovascular instability.\n\n**Why wrong:**\n*   **Morphine:** Opioid withdrawal (morphine) is notoriously unpleasant, characterized by muscle aches, diarrhea, vomiting, and intense cravings, often requiring symptomatic management with clonidine, loperamide, and antiemetics.\n*   **Alcohol:** Alcohol withdrawal can range from mild anxiety to severe delirium tremens (DTs), a life-threatening condition requiring benzodiazepines and intensive monitoring.\n*   **Cocaine:** Cocaine withdrawal causes dysphoria, fatigue, increased appetite, and intense cravings. While not usually life-threatening physically, the psychological distress often necessitates supportive care and sometimes antidepressants.\n\n**Key Takeaway:** Cannabis withdrawal is the mildest of the listed substance withdrawals and often doesn't necessitate specific pharmacological intervention. \n\n**Mnemonic:** None",
      "ai_search_tags": "Substance Withdrawal > Cannabis Use Disorder > Addiction Medicine > Neurology > Psychiatry",
      "subject_name": "Psychiatry",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": true,
      "pyq_source": "NEET PG"
    },
    {
      "id": "6043d92c-7a5f-4c2a-a949-ca119cd89201",
      "question": "In an adult patient with OCD, which is the most common obsession?",
      "opa": "Aggression",
      "opb": "Pathological doubt",
      "opc": "Symmetry",
      "opd": "Sexual themes",
      "cop": 2,
      "explanation": "**Concept:** Obsessive-Compulsive Disorder (OCD) is characterized by obsessions (intrusive thoughts, images, or urges) and compulsions (repetitive behaviors or mental acts performed to reduce anxiety). Obsessions vary in content, but certain themes are more common than others.\n\n**Reasoning:** Pathological doubt, characterized by persistent questioning and a need for reassurance, is the *most* frequently reported obsession in adults with OCD. Individuals experience intrusive doubts about having performed actions correctly (e.g., locking the door, turning off the stove) or about potential harm coming to themselves or others. This leads to significant anxiety and compulsive checking behaviors. \n\n**Why wrong:**\n*   **A. Aggression:** While aggressive obsessions exist in OCD, they are less common than doubts. They typically involve fears of harming oneself or others, but are not the predominant obsession.\n*   **C. Symmetry:** Obsessions related to symmetry and ordering are common, but generally rank second to pathological doubt in prevalence. These involve a need for things to 'feel right' and can lead to compulsive arranging or ordering.\n*   **D. Sexual themes:** Sexual obsessions (e.g., intrusive thoughts about inappropriate sexual acts) are distressing but are also less common than pathological doubt. They often involve unwanted and disturbing thoughts that cause significant guilt and shame.\n\n**Key Takeaway:**  When considering the *most common* obsession in adult OCD, remember pathological doubt is the most prevalent. Understanding the frequency of different obsession themes is crucial for accurate diagnosis and treatment planning.\n\n**Mnemonic:** 'Doubt' is the most 'doubtful' obsession – meaning it's the one you should most readily suspect.",
      "ai_search_tags": "Obsessive-Compulsive Disorder > OCD Obsessions > Pathological Doubt > Adult Psychiatry > Mental Health",
      "subject_name": "Psychiatry",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "a8b70198-2795-4dcd-a6f8-2066403c55f2",
      "question": "Treatment of depression with suicidal tendencies is?",
      "opa": "Clozapine",
      "opb": "Mirtazapine",
      "opc": "Electroconvulsive Therapy (ECT)",
      "opd": "Olanzapine",
      "cop": 3,
      "explanation": "**Concept:** Depression with suicidal ideation represents a psychiatric emergency requiring rapid and effective intervention. While pharmacotherapy plays a role, immediate risk reduction is paramount.\n\n**Reasoning:** Electroconvulsive Therapy (ECT) is the gold standard treatment for severe depression with suicidal tendencies, particularly when there is a high risk of imminent harm. It offers the fastest response, often within days, and is more effective than antidepressants alone in acutely suicidal patients. It bypasses the delayed onset of action seen with medications and can be life-saving. \n\n**Why wrong:**\n*   **Clozapine:** An atypical antipsychotic, primarily used in treatment-resistant schizophrenia and to reduce suicidality in schizophrenia, *not* first-line for depression even with suicidal ideation.\n*   **Mirtazapine:** An antidepressant that can be helpful in depression, but its onset of action is slower than ECT and may not be sufficient in an acute suicidal crisis.\n*   **Olanzapine:** Another atypical antipsychotic, sometimes used as an adjunct in depression, but not the primary treatment for acute suicidality. It also has a slower onset of action than ECT.\n\n**Key Takeaway:** In patients with severe depression and active suicidal ideation, ECT is the treatment of choice due to its rapid onset and high efficacy in reducing suicidal risk.\n\n**Mnemonic:** None",
      "ai_search_tags": "Psychiatry > Mood Disorders > Major Depressive Disorder > Suicidal Ideation > Electroconvulsive Therapy",
      "subject_name": "Psychiatry",
      "topic_name": null,
      "difficulty": "Medium",
      "is_clinical": true,
      "pyq_source": "NEET PG"
    },
    {
      "id": "5a9bbc11-81f5-4455-bfb1-647ca3a80585",
      "question": "Lithium is used in prophylaxis of:",
      "opa": "Recurrent phobia",
      "opb": "Alcohol dependence",
      "opc": "Paranoid Schizophrenia",
      "opd": "Recurrent manic depressive attacks",
      "cop": 4,
      "explanation": "**Concept:** Mood stabilizers are medications primarily used to treat bipolar disorder, specifically to prevent or reduce the severity and frequency of mood episodes (mania and depression). Lithium is the classic and most well-established mood stabilizer.\n\n**Reasoning:** Lithium is highly effective in the long-term prophylaxis of recurrent manic-depressive illness (bipolar disorder). It reduces the frequency and intensity of both manic and depressive episodes. Its mechanism isn't fully understood, but it's thought to affect several neurotransmitter systems and intracellular signaling pathways.\n\n**Why wrong:**\n*   **A. Recurrent phobia:** Phobias are primarily treated with behavioral therapies like exposure therapy and, sometimes, selective serotonin reuptake inhibitors (SSRIs). Lithium has no significant role in phobia management.\n*   **B. Alcohol dependence:** Alcohol dependence is managed with psychosocial interventions, support groups, and medications like naltrexone, acamprosate, or disulfiram. Lithium is not a first-line or even commonly used treatment for alcohol dependence.\n*   **C. Paranoid Schizophrenia:** While mood stabilizers can sometimes be *adjunctive* treatment in schizophrenia, particularly if there's a mood component, the primary treatment for schizophrenia is antipsychotics. Lithium is not a first-line treatment for paranoid schizophrenia.\n\n**Key Takeaway:** Lithium's primary and most effective use is in preventing mood swings in bipolar disorder. It's the gold standard for long-term maintenance therapy.\n\n**Mnemonic:** 'Li'thium for 'Li'fting moods in Bipolar disorder.",
      "ai_search_tags": "Lithium > Bipolar Disorder > Mood Stabilizers > Psychiatry > Mental Health",
      "subject_name": "Psychiatry",
      "topic_name": null,
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    }
  ]
}