{
  "quiz_id": "quiz_2026_01_28_obstetrics__gynae",
  "subject": "Obstetrics  Gynae",
  "questions": [
    {
      "id": "6c330df7-d649-4dff-af45-2a8c3de2c6b1",
      "question": "What is the term given to the relationship of the fetus to the long axis of the uterus?",
      "opa": "The Presentation",
      "opb": "The Lie",
      "opc": "The Engagement",
      "opd": "The Version",
      "cop": 2,
      "explanation": "**Concept:** Obstetrics terminology related to fetal position within the uterus is crucial for understanding labor and delivery.\n\n**Reasoning:** The 'Lie' specifically describes the relationship of the fetus's long axis to the long axis of the uterus. It can be longitudinal (most common, ideal for vaginal delivery), transverse, or oblique. The question directly asks for this relationship, making 'The Lie' the correct answer.\n\n**Why wrong:**\n*   **The Presentation:** Refers to the part of the fetus entering the pelvic inlet first (e.g., cephalic, breech). It doesn't describe the axis relationship.\n*   **The Engagement:** Describes the descent of the fetal presenting part into the pelvic inlet. It's a stage of labor, not the axis relationship.\n*   **The Version:**  Is the process of changing the fetal lie – converting a breech or transverse lie to a longitudinal lie. It's an intervention, not the relationship itself.\n\n**Key Takeaway:** Remember 'Lie' for the axis relationship, 'Presentation' for the entering part, and 'Engagement' for descent into the pelvis.\n\n**Mnemonic:** 'Lie' is like 'lying along' the uterus's long axis.",
      "ai_search_tags": "Obstetrics & Gynecology > Fetal Positioning > Fetal Lie > Pregnancy > Labor & Delivery",
      "subject_name": "Obstetrics & Gynae",
      "topic_name": "Miscellaneous (Obs)",
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "ae5f9b5d-015d-41e5-ad7a-7e6c1fd93d75",
      "question": "In early pregnancy, the doubling time of beta-hCG is approximately:",
      "opa": "24 hours",
      "opb": "48 hours",
      "opc": "96 hours",
      "opd": "2 weeks",
      "cop": 2,
      "explanation": "**Concept:** Beta-hCG (beta-human chorionic gonadotropin) is a hormone produced during pregnancy. Its levels rise rapidly in early pregnancy, roughly doubling every 48-72 hours. This doubling time is a crucial indicator of a viable pregnancy.\n\n**Reasoning:** In a normal, developing pregnancy, beta-hCG levels approximately double every 48 hours during the first 6-8 weeks. This is because the trophoblast, the cells that will become the placenta, are rapidly proliferating. A consistent doubling time suggests a healthy pregnancy. Therefore, 48 hours is the most accurate answer.\n\n**Why wrong:**\n*   A. 24 hours: While hCG rises rapidly, a doubling time of 24 hours is *too* fast and not typically observed in a normal pregnancy. It might be seen in very early stages or in cases of multiple gestations.\n*   C. 96 hours: A doubling time of 96 hours is *too* slow and could indicate a non-viable pregnancy, ectopic pregnancy, or inaccurate dating.\n*   D. 2 weeks: 2 weeks is a period of time, not a doubling time. hCG levels change significantly over 2 weeks, but the *rate* of change is what's important, and that rate is expressed as a doubling time.\n\n**Key Takeaway:** Monitoring beta-hCG doubling times is a valuable tool in early pregnancy to assess viability and rule out ectopic pregnancy or impending miscarriage.\n\n**Mnemonic:** '48 hours – Healthy growth!'",
      "ai_search_tags": "Obstetrics > Pregnancy Hormones > Beta-hCG > Gestational Age > Reproductive Endocrinology",
      "subject_name": "Obstetrics & Gynae",
      "topic_name": "Miscellaneous (Gynae)",
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "cb44dee8-444c-458f-9e1d-1e917890fb0d",
      "question": "A lady presented with 7 weeks amenorrhea presented with slight vaginal spotting. CRL was 5 mm with well- formed gestational sac with calculated GA of 5.6 weeks on TVS. Next line of management?",
      "opa": "Wait for another 1 week and repeat TVS",
      "opb": "Surgical or medical evacuation",
      "opc": "Wait for another 4 weeks",
      "opd": "Serum hCG levels",
      "cop": 1,
      "explanation": "**Concept:** This question tests understanding of early pregnancy complications, specifically discrepancies between last menstrual period (LMP), clinical presentation, and ultrasound findings in the context of a possible early pregnancy loss or ectopic pregnancy.\n\n**Reasoning:** The patient presents with 7 weeks of amenorrhea but a CRL of 5mm corresponding to 5.6 weeks gestational age. This discrepancy of approximately 1.4 weeks is not immediately alarming. A 'wait and see' approach with repeat TVS in one week is the most appropriate initial management. This allows for confirmation of fetal viability and reassessment of gestational age. If the gestational sac grows appropriately and cardiac activity is visualized, it suggests a viable, though potentially slow-growing, pregnancy. \n\n**Why wrong:**\n*   **B. Surgical or medical evacuation:** Evacuation is premature. A discrepancy of 1.4 weeks doesn't automatically indicate a non-viable pregnancy. Intervention without further confirmation could lead to unnecessary treatment.\n*   **C. Wait for another 4 weeks:** Waiting 4 weeks is too long. If the pregnancy is non-viable, a delay in diagnosis and management could lead to complications like significant bleeding or require more complex intervention later.\n*   **D. Serum hCG levels:** While serial hCG levels can be helpful, a single hCG level is less informative than a repeat ultrasound. Ultrasound provides direct visualization of the gestational sac and fetal development, which is crucial in this scenario. hCG levels can be normal in ectopic pregnancies or early non-viable pregnancies.\n\n**Key Takeaway:** In early pregnancy with a discrepancy between LMP and ultrasound findings, a short interval repeat ultrasound is the initial step to assess fetal viability and gestational age before considering more invasive management.\n\n**Mnemonic:** 'Wait, Watch, and Repeat' – for early pregnancy discrepancies.",
      "ai_search_tags": "Obstetrics > Early Pregnancy > Ultrasound > Gestational Sac > Threatened Abortion",
      "subject_name": "Obstetrics & Gynae",
      "topic_name": "Miscellaneous (Obs)",
      "difficulty": "Easy",
      "is_clinical": true,
      "pyq_source": "NEET PG"
    },
    {
      "id": "23c0b60b-1a79-4563-b7de-d3a017ff5cc1",
      "question": "Fimbriectomy is also known as:",
      "opa": "Pomeroy technique",
      "opb": "Uchida's procedure",
      "opc": "Kroener's procedure",
      "opd": "Irving's procedure",
      "cop": 3,
      "explanation": "**Concept:** Fimbriectomy refers to the surgical removal of the fimbriae of the fallopian tubes. This procedure is historically used in tubal ligation for sterilization.\n\n**Reasoning:** Kroener's procedure specifically describes a method of tubal ligation involving fimbriectomy – removal of a segment of the fimbria. This creates a stoma between the tubal ends, which subsequently close off. Therefore, fimbriectomy is synonymous with Kroener's procedure.\n\n**Why wrong:**\n*   **Pomeroy technique:** This involves ligating the fallopian tube with a non-absorbable suture and then crushing the tube between the ligatures. It doesn't involve removing the fimbriae.\n*   **Uchida's procedure:** This is a method of tubal ligation using electrocautery to coagulate and seal the fallopian tubes. Again, it doesn't specifically involve fimbriectomy.\n*   **Irving's procedure:** This involves resection and anastomosis of the fallopian tubes, a reconstructive procedure, and is not related to sterilization via fimbrial removal.\n\n**Key Takeaway:**  Understanding the specific techniques used in tubal ligation is crucial. Kroener's procedure is uniquely defined by the removal of the fimbriae.\n\n**Mnemonic:** 'Kroener's cuts the fringe' (fringe referring to the fimbriae).",
      "ai_search_tags": "Gynecology > Reproductive Surgery > Tubal Ligation > Fimbriectomy > Family Planning",
      "subject_name": "Obstetrics & Gynae",
      "topic_name": "Disorders Of Menstruation",
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "cb3ad8c2-5fef-491c-9004-53d996a91f26",
      "question": "A 55-year-old woman is diagnosed with invasive cervical carcinoma by cone biopsy. Pelvic examination and rectal examination reveal the parametrium is free of disease but upper part of vagina is involved with tumor. IVP and sigmoidoscopy are negative but CT Scan of abdomen and pelvis shows grossly enlarged pelvic and para aortic nodes. Thus patient is classified as stage:",
      "opa": "IIa",
      "opb": "IIb",
      "opc": "IIIa",
      "opd": "IIIb",
      "cop": 1,
      "explanation": "**Concept:** Cervical cancer staging is based on the FIGO (International Federation of Gynecology and Obstetrics) system. The stage is determined by the extent of the primary tumor, involvement of regional lymph nodes, and distant metastasis. Key factors include tumor size, depth of invasion, parametrial involvement, vaginal involvement, and nodal status.\n\n**Reasoning:** The patient has invasive cervical carcinoma. The cone biopsy confirms this. The upper part of the vagina is involved, indicating extension beyond the cervix. However, the parametrium is free, which is crucial. The CT scan reveals enlarged pelvic and para-aortic nodes. According to FIGO staging:\n\n*   Stage II: The tumor extends beyond the cervix but has not extended to the pelvic wall or to the lower third of the vagina.\n*   Stage IIa: Without parametrial involvement. The upper vaginal involvement fits here.\n*   Stage III: The tumor extends to the pelvic wall and/or involves the lower third of the vagina, or causes hydronephrosis or non-functioning kidney.\n\nSince the parametrium is free and the vaginal involvement is limited to the upper part, and there is nodal involvement, the correct stage is IIa. Nodal involvement doesn't change the stage from IIa to III in this scenario because the primary tumor extension criteria for IIa are met.\n\n**Why wrong:**\n*   B. IIb: IIb requires involvement of the lower third of the vagina, which is not present in this case.\n*   C. IIIa: IIIa requires involvement of the lower third of the vagina or pelvic wall involvement, neither of which is present.\n*   D. IIIb: IIIb requires involvement of the pelvic wall and/or hydronephrosis/non-functioning kidney, which are absent.\n\n**Key Takeaway:** Carefully differentiate between upper and lower vaginal involvement when staging cervical cancer. Parametrial involvement is a critical factor in determining stage III disease. Nodal involvement is considered in overall prognosis but doesn't automatically upstage the primary tumor if the primary tumor extension criteria for a lower stage are met.\n\n**Mnemonic:** 'Parametrium free, upper vagina – think IIa'",
      "ai_search_tags": "Gynecology > Oncology > Cervical Cancer > Staging > FIGO Staging",
      "subject_name": "Obstetrics & Gynae",
      "topic_name": "Gynaecological Oncology",
      "difficulty": "Medium",
      "is_clinical": true,
      "pyq_source": "NEET PG"
    },
    {
      "id": "f3502443-36d0-4a03-9144-cef17fa5e2ee",
      "question": "Late hyperglycemia in pregnancy is associated with/can cause which of the following?",
      "opa": "Macrosomia",
      "opb": "IUGR",
      "opc": "Postmaturity",
      "opd": "Congenital malformation",
      "cop": 1,
      "explanation": "**Concept:** Gestational diabetes mellitus (GDM) involves hyperglycemia developing during pregnancy. Late hyperglycemia, specifically, refers to elevated blood glucose levels occurring later in gestation (typically the second or third trimester).\n\n**Reasoning:** Late hyperglycemia in pregnancy leads to fetal hyperinsulinemia. Insulin acts as a growth hormone, and excessive insulin exposure in the fetus results in increased growth, particularly in length and weight. This overgrowth is termed 'macrosomia', defined as a birth weight greater than 4000 grams or above the 90th percentile for gestational age. The fetus gains excessive subcutaneous fat.\n\n**Why wrong:**\n*   **B. IUGR (Intrauterine Growth Restriction):** IUGR is more commonly associated with *early* onset or poorly controlled GDM, where placental insufficiency can limit fetal growth. Late hyperglycemia primarily causes overgrowth, not undergrowth.\n*   **C. Postmaturity:** Postmaturity refers to a pregnancy extending beyond 42 weeks. While diabetic pregnancies have a slightly increased risk of postmaturity, it's not a direct consequence of late hyperglycemia itself, but rather a complication of the overall diabetic state and attempts at induction.\n*   **D. Congenital malformation:** Congenital malformations are most strongly linked to hyperglycemia during *organogenesis* – the first trimester. Late hyperglycemia doesn't typically cause new congenital malformations; it primarily affects fetal growth.\n\n**Key Takeaway:** Late hyperglycemia in pregnancy drives fetal hyperinsulinemia, leading to macrosomia. Understanding the timing of hyperglycemia and its effects on fetal development is crucial for managing diabetic pregnancies.\n\n**Mnemonic:** 'Late & Great' - Late hyperglycemia leads to a 'great' (large) baby (macrosomia).",
      "ai_search_tags": "Obstetrics & Gynecology > Pregnancy Complications > Gestational Diabetes > Fetal Effects > Maternal-Fetal Medicine",
      "subject_name": "Obstetrics & Gynae",
      "topic_name": "Gestational Diabetes Mellitus",
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "1217d11a-33bd-4b4d-8328-255508e6a865",
      "question": "Caudal regression syndrome is seen in babies of mothers having:",
      "opa": "Diabetes",
      "opb": "PIH",
      "opc": "Cardiac disease",
      "opd": "Anaemia",
      "cop": 1,
      "explanation": "**Concept:** Caudal regression syndrome (CRS) is a rare congenital anomaly characterized by the incomplete development of the lower spine and associated structures. It ranges in severity from mild vertebral anomalies to complete absence of the sacrum and lower limbs. Maternal diabetes, particularly poorly controlled diabetes, is a well-established risk factor.\n\n**Reasoning:** The pathogenesis of CRS in diabetic pregnancies is thought to be related to hyperglycemia-induced disruption of the retinoic acid signaling pathway, which is crucial for early embryonic development, specifically in the caudal region. High glucose levels can alter retinoic acid metabolism, leading to abnormal development of the vertebral column and associated structures. Therefore, babies born to mothers with diabetes are at a significantly increased risk of developing CRS.\n\n**Why wrong:**\n*   **B. PIH (Pregnancy Induced Hypertension):** While PIH can have various adverse effects on fetal development, it is not directly linked to caudal regression syndrome.\n*   **C. Cardiac disease:** Maternal cardiac disease can cause fetal hypoxia and growth restriction, but it doesn't have a specific association with the developmental defects seen in CRS.\n*   **D. Anaemia:** Anaemia in pregnancy can lead to fetal complications like low birth weight and preterm birth, but it is not a known cause of caudal regression syndrome.\n\n**Key Takeaway:** Maternal diabetes, especially when poorly controlled, is the strongest known risk factor for caudal regression syndrome. Maintaining good glycemic control during pregnancy is crucial for reducing the risk of this and other congenital anomalies.\n\n**Mnemonic:** 'Diabetes disrupts development Down below' (referring to the caudal/lower region)",
      "ai_search_tags": "Obstetrics > Diabetic Embryopathy > Caudal Regression Syndrome > Pregnancy Complications > Maternal Health",
      "subject_name": "Obstetrics & Gynae",
      "topic_name": "Medical & Surgical Illness Complication Pregnancy",
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "fe2df381-cf9a-42c2-af53-ae168bbf006e",
      "question": "Ideal contraceptive for newly married couple is:",
      "opa": "Barrier method",
      "opb": "Combined OCPs",
      "opc": "IUCD",
      "opd": "Progesterone only pill",
      "cop": 2,
      "explanation": "### Concept: Ideal Contraceptive for Newly Married Couple\n\n### Reasoning: The ideal contraceptive for a newly married couple is one that is effective, convenient, and has minimal side effects. Combined Oral Contraceptive Pills (COCs) meet these criteria.\n\n### Why wrong: \n\n* **Barrier method (A)**: While effective, barrier methods like condoms require consistent use and may not be as effective as COCs. They also do not protect against STIs.\n\n* **IUCD (C)**: IUCDs are highly effective but require a medical procedure for insertion and may not be suitable for all women. They also do not protect against STIs.\n\n* **Progesterone only pill (D)**: Progesterone only pills (POPs) are less effective than COCs and may not be suitable for all women, particularly those with a history of thromboembolism.\n\n### Key Takeaway: COCs are the ideal contraceptive for newly married couples due to their high efficacy, convenience, and minimal side effects.\n\n### Mnemonic: COCs are the 'Gold Standard' for contraception.",
      "ai_search_tags": "Obstetrics & Gynecology > Contraception > Oral Contraceptives > Family Planning > Reproductive Health",
      "subject_name": "Obstetrics & Gynae",
      "topic_name": "Methods - Combined Oestrogen-Progestogen Methods",
      "difficulty": "Medium",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "a45b077f-2131-41a3-8a89-98e7cff2ce32",
      "question": "Treatment of choice for adenomyosis is?",
      "opa": "Estrogens only",
      "opb": "Oral Contraceptive Pills (OCP)",
      "opc": "Laser Endoscopy",
      "opd": "Hysterectomy",
      "cop": 4,
      "explanation": "**Concept:** Adenomyosis is a condition where endometrial tissue grows into the muscular wall of the uterus (myometrium). It causes heavy, painful periods and can lead to uterine enlargement. Treatment options range from medical management to surgical intervention.\n\n**Reasoning:** Hysterectomy is the definitive treatment for adenomyosis. It completely removes the source of the endometrial tissue, thus eliminating the symptoms. While other treatments can manage symptoms, they do not cure the condition. For women who have completed childbearing, hysterectomy offers the most reliable and long-lasting solution.\n\n**Why wrong:**\n*   **A. Estrogens only:** Estrogens can actually worsen adenomyosis by stimulating endometrial tissue growth. They are generally contraindicated.\n*   **B. Oral Contraceptive Pills (OCP):** OCPs can help manage symptoms like heavy bleeding and pain by suppressing ovulation and reducing endometrial proliferation, but they do not address the underlying adenomyosis and symptoms often recur when stopped. They are a medical management option, not a cure.\n*   **C. Laser Endoscopy:** Laser endoscopy or other endometrial ablation techniques can be considered for milder cases or in women desiring to preserve fertility, but they are not as effective as hysterectomy for severe adenomyosis and have a higher recurrence rate.\n\n**Key Takeaway:** Hysterectomy remains the gold standard treatment for adenomyosis, particularly in women who have completed their families. Medical management options are useful for symptom control but do not provide a definitive cure.\n\n**Mnemonic:** 'Hysterectomy halts adenomyosis'",
      "ai_search_tags": "Gynecology > Adenomyosis > Uterine Disorders > Pelvic Pain > Women's Health",
      "subject_name": "Obstetrics & Gynae",
      "topic_name": "Endometriosis And Dysmenorrhea",
      "difficulty": "Easy",
      "is_clinical": false,
      "pyq_source": "NEET PG"
    },
    {
      "id": "76206694-dbc1-4e92-ab61-e0c1c988475a",
      "question": "A 30-year-old Para 2 Live 2, with her last child born 1 year ago, desires immediate contraception following a second vaginal delivery. Which of the following is the most ideal method?",
      "opa": "Post-placental IUCD",
      "opb": "Sterilization",
      "opc": "Oral Contraceptive Pills (OCP)",
      "opd": "Female condoms",
      "cop": 2,
      "explanation": "**Concept:** Postpartum contraception is a crucial aspect of family planning. The ideal method should be highly effective, convenient, and acceptable to the patient. Sterilization offers a permanent solution, while other methods require ongoing adherence and have varying failure rates.\n\n**Reasoning:** Given the patient's history (Para 2 Live 2, recent delivery 1 year ago) and desire for 'immediate' contraception, sterilization is the most ideal. She has completed her desired family size and wants a highly effective, permanent method. Postpartum sterilization (usually laparoscopic tubal ligation) is safest and easiest to perform within the first few weeks postpartum. It avoids the risk of failure associated with other methods and eliminates the need for continued use.\n\n**Why wrong:**\n*   **A. Post-placental IUCD:** While a good option, it's not 'most ideal' given the patient's stated desire for immediate and likely permanent contraception. IUCDs are reversible and require follow-up for check-ups and potential complications. There's also a slightly higher expulsion rate if inserted immediately postpartum.\n*   **C. Oral Contraceptive Pills (OCP):** OCPs are effective but require strict adherence. They are also contraindicated in certain situations (e.g., breastfeeding, certain medical conditions). The patient specifically asked for 'immediate' contraception, and OCPs take time to achieve full effectiveness.\n*   **D. Female condoms:** Female condoms have a higher failure rate compared to sterilization or long-acting reversible contraceptives (LARCs) like IUCDs. They are also user-dependent and not ideal for someone seeking a highly reliable, immediate solution.\n\n**Key Takeaway:** For women who have completed their desired family size and want a highly effective, permanent contraception method, sterilization is often the most appropriate choice, especially in the postpartum period.\n\n**Mnemonic:** 'Para 2, Done with two, Sterilization is true!'",
      "ai_search_tags": "Obstetrics & Gynecology > Contraception > Postpartum Care > IUCD > Family Planning",
      "subject_name": "Obstetrics & Gynae",
      "topic_name": "Jipmer 2018",
      "difficulty": "Easy",
      "is_clinical": true,
      "pyq_source": "NEET PG"
    }
  ]
}